app/Models/SesionMenuModel.php

SELECT `p`.`NOMBRE` `NOMBRE_PRODUCTO`, `m`.`NOMBRE` `NOMBRE_MODULO`, `t`.`NOMBRE`, `t`.`RUTA`, `t`.`IDTRANSACCION`, `t`.`IDPRODUCTO`, `t`.`IDMODULO`
FROM `ADMIN_SESIONMENU` `sm`
JOIN `ADMIN_TRANSACCION` `t` ON `sm`.`IDTRANSACCION` = `t`.`IDTRANSACCION`
LEFT JOIN `ADMIN_MODULO` `m` ON `t`.`IDMODULO` = `m`.`IDMODULO`
LEFT JOIN `ADMIN_PRODUCTO` `p` ON `t`.`IDPRODUCTO` = `p`.`IDPRODUCTO`
WHERE `sm`.`IDSESION` = 455
AND `sm`.`ESTADO` = 'A'
AND `t`.`ESTADO` = 'A'
AND `m`.`ESTADO` = 'A'
AND `p`.`ESTADO` = 'A'
GROUP BY `p`.`NOMBRE`, `m`.`NOMBRE`, `t`.`NOMBRE`, `t`.`RUTA`, `t`.`IDTRANSACCION`, `t`.`IDPRODUCTO`, `t`.`IDMODULO`
---
    public function getMenuByUser($sessionId)
    {
        $results = $this->db->table('ADMIN_SESIONMENU sm')
            ->select('
                p.NOMBRE AS NOMBRE_PRODUCTO,
                m.NOMBRE AS NOMBRE_MODULO,
                t.NOMBRE,
                t.RUTA,
                t.IDTRANSACCION,
                t.IDPRODUCTO,
                t.IDMODULO
            ')
            ->join('ADMIN_TRANSACCION t', 'sm.IDTRANSACCION = t.IDTRANSACCION')
            ->join('ADMIN_MODULO m', 't.IDMODULO = m.IDMODULO', 'left')
            ->join('ADMIN_PRODUCTO p', 't.IDPRODUCTO = p.IDPRODUCTO', 'left')
            ->where('sm.IDSESION', $sessionId)
            ->where('sm.ESTADO', 'A')
            ->where('t.ESTADO', 'A')
            ->where('m.ESTADO', 'A')
            ->where('p.ESTADO', 'A')
            ->groupBy('p.NOMBRE, m.NOMBRE, t.NOMBRE, t.RUTA, t.IDTRANSACCION, t.IDPRODUCTO, t.IDMODULO')
            ->get()
            ->getResultArray();